{
  "title":"The Simpler Philosophy",
  "ideas":[
    {
      "heading":"The critical issue",
      "subideas":[
        {
          "content":"How to provide the html items id's in hierarchy?"
        },
        {
          "content":"This is really the critical issue. This is the whole divide between srr and csr."
        },
        {
          "content":"CSR is the easier, but looses the speed, potency, dynamicity and SEO power of SSR."
        },
        {
          "content":"I'll go to SRR layouts, that CSR and Hidrate subcomponents."
        },
        {
          "content":"This is the value proposition of Simpler, we offer the simplest, most technology agnostic, and most capable approach."
        },
        {
          "content":"We render the static parts of the components along with it's requests for js files that perform the components and subcomponents Hydration and dynamicity."
        },
        {
          "content":"But the hardest part of this is to solve the divide between the SRR data and the independant js files."
        },
        {
          "content":"How to connect this disconnected technologies."
        },
        {
          "content":"The answer is design."
        },
        {
          "content":"Actually, this dificulty is an advantage for software design."
        },
        {
          "content":"Because the technologies are disconected, you have to design a decoupled system."
        },
        {
          "content":"The practical application of this is to render the component static parts along with it's .js files request scritp tags, but also the key component, the bridge component."
        },
        {
          "content":"This bridge is a script tag that contains at least three things: Critical constants, a component structure object, and the log of such object to console."
        },
        {
          "content":"In this manner, the third component, the agent, gets the available decoupled actions from the .js file, get's the elements from the SRR redered script tag, and runs the required functions over the declared elements on the page scope."
        },
        {
          "content":"But you'll need more than an agent, you'll also need a binding."
        },
        {
          "content":"This binding is an object that relates the component to the decoupled action, informing the agent on available actions."
        }
      ]
    }
  ]
}